# -----------------------------
# YOLO11-RDS  ➜  RHDWT + DySample + SAFM
# -----------------------------
# 用法：model=yolo11-rds.yaml  scale=n/s/m/l/x
# 注意：需先在 ultralytics/nn/modules 里注册
#       RHDWT_Block | DySample | SAFMNPP
# -----------------------------

# 1. 基础参数
nc: 80        # 类别数，按需修改
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# 2. Backbone —— 依次插入 RHDWT
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          #  0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]         #  1  P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, RHDWT_Block, [256, 32]]    #  3  P3/8   ➜ RHDWT
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, RHDWT_Block, [512, 64]]    #  5  P4/16  ➜ RHDWT
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, RHDWT_Block, [1024, 128]]  #  7  P5/32  ➜ RHDWT
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]            #  9
  - [-1, 2, C2PSA, [1024]]             # 10

# 3. Head —— 先DySample上采样，后SAFM增强
head:
  # 10 → 13：P4 分支
  - [-1, 1, DySample, []]              # 11  2×可学习上采样
  - [[-1, 6], 1, Concat, [1]]          # 12  cat backbone P4
  - [-1, 1, SAFMNPP, [512]]            # 12½ ➜ SAFM 增强
  - [-1, 2, C3k2, [512, False]]        # 13

  # 13 → 16：P3 分支
  - [-1, 1, DySample, []]              # 14  2×可学习上采样
  - [[-1, 4], 1, Concat, [1]]          # 15  cat backbone P3
  - [-1, 1, SAFMNPP, [256]]            # 15½ ➜ SAFM 增强
  - [-1, 2, C3k2, [256, False]]        # 16  (P3/8-small)

  # 16 → 19：P4 融合
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]         # 18  cat head P4
  - [-1, 1, SAFMNPP, [512]]            # 18½ ➜ SAFM 增强
  - [-1, 2, C3k2, [512, False]]        # 19  (P4/16-medium)

  # 19 → 22：P5 融合
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]         # 21  cat head P5
  - [-1, 1, SAFMNPP, [1024]]           # 21½ ➜ SAFM 增强
  - [-1, 2, C3k2, [1024, True]]        # 22  (P5/32-large)

  # 4. 检测头
  - [[16, 19, 22], 1, Detect, [nc]]    # 23  Detect(P3, P4, P5)